#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ОписаниеПеременных

Перем ЭтоНовыйДокумент;

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Специалист = Пользователи.ТекущийПользователь();
		
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ,Режим)
	
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ВКМ_ОбслуживаниеКлиента.Специалист КАК Специалист,
		|	ВКМ_УсловияОплатыСотрудниковСрезПоследних.ПроцентОтРабот КАК ПроцентОтРабот
		|ИЗ
		|	Документ.ВКМ_ОбслуживаниеКлиента КАК ВКМ_ОбслуживаниеКлиента
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ВКМ_УсловияОплатыСотрудников.СрезПоследних(&Дата, Специалист = &Специалист) КАК
		|			ВКМ_УсловияОплатыСотрудниковСрезПоследних
		|		ПО ВКМ_ОбслуживаниеКлиента.Специалист = ВКМ_УсловияОплатыСотрудниковСрезПоследних.Специалист
		|ГДЕ
		|	ВКМ_ОбслуживаниеКлиента.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Специалист", Специалист);
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если НЕ Выборка.Следующий() Тогда
		
		Отказ = Истина;
		ОбщегоНазначения.СообщитьПользователю("У сотрудника не указан процент от оплаты работ. Документ не проведен.");
		Возврат;
	Иначе 
		Процент = Выборка.ПроцентОтРабот;
	КонецЕсли;
	

	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ДоговорыКонтрагентов.ВКМ_СтоимостьЧаса КАК ВКМ_СтоимостьЧаса,
		|	ДоговорыКонтрагентов.ВКМ_ДатаНачала КАК ВКМ_ДатаНачала,
		|	ДоговорыКонтрагентов.ВКМ_ДатаОкончания КАК ВКМ_ДатаОкончания,
		|	ДоговорыКонтрагентов.ВидДоговора КАК ВидДоговора,
		|	ВКМ_ОбслуживаниеКлиента.Специалист КАК Специалист,
		|	ВКМ_ОбслуживаниеКлиента.Договор КАК Договор,
		|	ВКМ_ОбслуживаниеКлиента.Клиент КАК Клиент
		|ИЗ
		|	Документ.ВКМ_ОбслуживаниеКлиента КАК ВКМ_ОбслуживаниеКлиента
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
		|		ПО ВКМ_ОбслуживаниеКлиента.Договор = ДоговорыКонтрагентов.Ссылка
		|ГДЕ
		|	ВКМ_ОбслуживаниеКлиента.Ссылка = &Ссылка
		|	И (ДоговорыКонтрагентов.ВКМ_ДатаНачала <= ВКМ_ОбслуживаниеКлиента.Дата
		|	И ВКМ_ОбслуживаниеКлиента.Дата <= ДоговорыКонтрагентов.ВКМ_ДатаОкончания)
		|	И ДоговорыКонтрагентов.ВидДоговора = &ВидДоговора";
	
	Запрос.УстановитьПараметр("ВидДоговора", Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Не Выборка.Следующий() Тогда
		ОбщегоНазначения.СообщитьПользователю("Документ не проведен. Проверьте сроки действия Договора контрагента и тип договора");
        Отказ = Истина;
        Возврат;
    КонецЕсли;
	
	Движения.ВКМ_ВыполненныеКлиентуРаботы.Записывать = Истина;
	Движения.ВКМ_ВыполненныеСотрудникомРаботы.Записывать = Истина;
		
		//Движение по регистру ВКМ_ВыполненныеКлиентуРаботы
		ДвижениеКлиента = Движения.ВКМ_ВыполненныеКлиентуРаботы.Добавить();
		ДвижениеКлиента.Период = Дата;
		ДвижениеКлиента.ВидДвижения = ВидДвиженияНакопления.Приход;
		ДвижениеКлиента.Клиент = Клиент;
		ДвижениеКлиента.Договор = Договор;
		СтоимостьЧаса = Выборка.ВКМ_СтоимостьЧаса;
		
		//Движение по регистру ВКМ_ВыполненныеСотрудникомРаботы
		ДвижениеСотрудника = Движения.ВКМ_ВыполненныеСотрудникомРаботы.Добавить();
		ДвижениеСотрудника.Период = Дата;
		ДвижениеСотрудника.ВидДвижения = ВидДвиженияНакопления.Приход;
		ДвижениеСотрудника.Специалист = Выборка.Специалист;
		
		
		Запрос = Новый Запрос;
		Запрос.Текст =
			"ВЫБРАТЬ
			|	ВКМ_ОбслуживаниеКлиентаВыполненныеРаботы.Ссылка КАК Ссылка,
			|	СУММА(ВКМ_ОбслуживаниеКлиентаВыполненныеРаботы.ЧасыКОплатеКлиенту) КАК ЧасыКОплатеКлиенту
			|ИЗ
			|	Документ.ВКМ_ОбслуживаниеКлиента.ВыполненныеРаботы КАК ВКМ_ОбслуживаниеКлиентаВыполненныеРаботы
			|ГДЕ
			|	ВКМ_ОбслуживаниеКлиентаВыполненныеРаботы.Ссылка = &Ссылка
			|СГРУППИРОВАТЬ ПО
			|	ВКМ_ОбслуживаниеКлиентаВыполненныеРаботы.Ссылка";
		
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Выборка = РезультатЗапроса.Выбрать();
		
		Если Не Выборка.Следующий() Тогда
			ОбщегоНазначения.СообщитьПользователю("Документ не проведен. Проверьте, что в документ введены выполненные работы");
        	Отказ = Истина;
        	Возврат;
		КонецЕсли;
		
		//Движение по регистру ВКМ_ВыполненныеКлиентуРаботы
		ДвижениеКлиента.КоличествоЧасов = Выборка.ЧасыКОплатеКлиенту;
		ДвижениеКлиента.СуммаКОплате = СтоимостьЧаса * Выборка.ЧасыКОплатеКлиенту;
		
		//Движение по регистру ВКМ_ВыполненныеСотрудникомРаботы
		ДвижениеСотрудника.ЧасовКОплате = Выборка.ЧасыКОплатеКлиенту;
		ДвижениеСотрудника.СуммаКОплате = СтоимостьЧаса * Выборка.ЧасыКОплатеКлиенту * Процент / 100;
		
	Движения.ВКМ_ВыполненныеКлиентуРаботы.Записать();
	Движения.ВКМ_ВыполненныеСотрудникомРаботы.Записать();
	
КонецПроцедуры



Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
        Возврат;
	КонецЕсли;
	
	ЭтоНовыйДокумент = Ссылка.Пустая();
	Если НЕ ЭтоНовыйДокумент Тогда
	
		СтарыйОбъект = Ссылка.ПолучитьОбъект();
	
	Если СтарыйОбъект <> Неопределено Тогда
		Если СтарыйОбъект.Специалист <> Специалист 
			ИЛИ СтарыйОбъект.ДатаПроведенияРабот <> ДатаПроведенияРабот
			ИЛИ СтарыйОбъект.ВремяНачалоПлан <> ВремяНачалоПлан
			ИЛИ СтарыйОбъект.ВремяОкончаниеПлан <> ВремяОкончаниеПлан
			ИЛИ СтарыйОбъект.Клиент <> Клиент Тогда
			СоздатьУведомление();
		КонецЕсли;
	КонецЕсли;
	КонецЕсли;
КонецПроцедуры




Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
        Возврат;
	КонецЕсли;
	
	Если ЭтоНовыйДокумент Тогда
		СоздатьУведомление();
	КонецЕсли;


КонецПроцедуры
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура СоздатьУведомление()

	ТекстУведомления = "Обслуживание № " + СокрЛП(Номер) + Символы.ПС +
						"Получатель: " + СокрЛП(Клиент) + Символы.ПС +
						"Дата: " + Формат(ДатаПроведенияРабот, "ДФ=dd.MM.yyyy") + Символы.ПС +
						"Время начала работ: " + Формат(ВремяНачалоПлан, "ДФ=ЧЧ:мм") + Символы.ПС +
						"Время окончания работ: " + Формат(ВремяОкончаниеПлан, "ДФ=ЧЧ:мм") + Символы.ПС +
						"Специалист: " + СокрЛП(Специалист);
						
	Уведомление = Справочники.ВКМ_УведомленияТелеграм.СоздатьЭлемент();
	Уведомление.ТекстСообщения = ТекстУведомления;
	Уведомление.Записать();
КонецПроцедуры

#КонецОбласти



#КонецЕсли