#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	ПередЗаписьюНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере()
	УстановитьПодсветкуСтрок();
КонецПроцедуры


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	УстановитьПодсветкуСтрок();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьПодсветкуСтрок();
КонецПроцедуры
#КонецОбласти


#Область ОбработчикиСобытийЭлементовТаблицыФормыОтпускаСотрудников

&НаКлиенте
Процедура ОтпускаСотрудниковПриИзменении(Элемент)
	УстановитьПодсветкуСтрок();
КонецПроцедуры

&НаКлиенте
Процедура ОтпускаСотрудниковПриАктивизацииСтроки(Элемент)
	УстановитьПодсветкуСтрок();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ДиаграммаГанта(Команда)
	
	АдресВХранилище = ПоместитьВоВременоеХранилищеНаСервере();
	ПараметрыФормы = Новый Структура("АдресВХранилище", АдресВХранилище);
	ОткрытьФорму("Документ.ВКМ_ГрафикОтпусков.Форма.АнализГрафика", ПараметрыФормы, ЭтотОбъект);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

	
&НаСервере
Функция ПоместитьВоВременоеХранилищеНаСервере()

	АдресВХранилище = ПоместитьВоВременноеХранилище(Объект.ОтпускаСотрудников.Выгрузить( , "Сотрудник,ДатаНачала,ДатаОкончания"), );
	Возврат АдресВХранилище;

КонецФункции

&НаСервере
Процедура УстановитьПодсветкуСтрок()
	
	СуммаДнейОтпускаСотрудника = Новый Соответствие;
	
	Для Каждого Строка Из Объект.ОтпускаСотрудников Цикл
		
		КолвоДней = (Строка.ДатаОкончания - Строка.ДатаНачала) / 86400 +1;
		ТекущееКолвоДней = СуммаДнейОтпускаСотрудника.Получить(Строка.Сотрудник);
		Если ТекущееКолвоДней = Неопределено Тогда
			СуммаДнейОтпускаСотрудника.Вставить(Строка.Сотрудник, КолвоДней);
		Иначе
			СуммаДнейОтпускаСотрудника.Вставить(Строка.Сотрудник, ТекущееКолвоДней + КолвоДней);
		КонецЕсли;
		
	КонецЦикла;
	
	Для Каждого Строка Из Объект.ОтпускаСотрудников Цикл
		
		Строка.СуммарноеКоличествоДней = СуммаДнейОтпускаСотрудника.Получить(Строка.Сотрудник);

	КонецЦикла;
КонецПроцедуры 


#КонецОбласти