
#Если Сервер  Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Создает или обновляет документы реализации для всех договоров в табличной части
//
// Параметры:
//   Период - Дата - месяц, за который создаются документы
//   Таблица - ТаблицаЗначений - копия ТЧ СписокСозданныхРеализацийУслуг
//   
// Возвращаемое значение:
//   ТаблицаЗначений - содержит договоры и ссылки на созданные документы реализации
//
Функция СоздатьИлиОбновитьРеализации(Период, Таблица) Экспорт
	
	РезультатТаблица = Новый ТаблицаЗначений;
	РезультатТаблица.Колонки.Добавить("Договор");
	РезультатТаблица.Колонки.Добавить("СсылкаНаРеализацию");
	Для Каждого СтрокаТаблицы Из Таблица Цикл
		
		Если ЗначениеЗаполнено(СтрокаТаблицы.СсылкаНаРеализацию) Тогда
			ДокументОбъект = СтрокаТаблицы.СсылкаНаРеализацию.ПолучитьОбъект();
			ДокументОбъект.ВКМ_ВыполнитьАвтозаполнение();
			ДокументОбъект.Записать();
			ДокументОбъект.ПроверитьЗаполнение();
			ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
			Если ДокументОбъект.Услуги.Количество() > 0 Тогда
				НоваяСтрока = РезультатТаблица.Добавить();
				НоваяСтрока.Договор = СтрокаТаблицы.Договор;
				НоваяСтрока.СсылкаНаРеализацию = ДокументОбъект.Ссылка;
			КонецЕсли;
		Иначе 
			ДокументОбъект = Документы.РеализацияТоваровУслуг.СоздатьДокумент();
			ДокументОбъект.Дата = КонецМесяца(Период);
			ДокументОбъект.Организация = СтрокаТаблицы.Договор.Организация;
			ДокументОбъект.Контрагент = СтрокаТаблицы.Договор.Владелец;
			ДокументОбъект.Договор = СтрокаТаблицы.Договор;
			ДокументОбъект.ВКМ_ВыполнитьАвтозаполнение();
			ДокументОбъект.Записать();
			ДокументОбъект.ПроверитьЗаполнение();
			ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
			Если ДокументОбъект.Услуги.Количество() > 0 Тогда
				НоваяСтрока = РезультатТаблица.Добавить();
				НоваяСтрока.Договор = СтрокаТаблицы.Договор;
				НоваяСтрока.СсылкаНаРеализацию = ДокументОбъект.Ссылка;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
		
	Возврат РезультатТаблица;  
	
КонецФункции

#КонецОбласти

#КонецЕсли
