
#Если Сервер Тогда

#Область ПрограммныйИнтерфейс

// Заполняет табличную часть списком абонентских договоров, активных на период
//
// Параметры:
//   ПериодМесяц - Дата - месяц, за который нужно найти договоры
//
Процедура ЗаполнитьСписокДоговоров(ПериодМесяц) Экспорт
	
	НачалоПериода = НачалоМесяца(ПериодМесяц);
	КонецПериода = КонецМесяца(ПериодМесяц);

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ДоговорыКонтрагентов.Ссылка КАК Договор,
		|	РеализацияТоваровУслуг.Ссылка КАК Реализация,
		|	РеализацияТоваровУслуг.Услуги.(
		|		Ссылка КАК Ссылка,
		|		НомерСтроки КАК НомерСтроки,
		|		Номенклатура КАК Номенклатура,
		|		Количество КАК Количество,
		|		Цена КАК Цена,
		|		Сумма КАК Сумма) КАК Услуги
		|ИЗ
		|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
		|		ПО РеализацияТоваровУслуг.Договор = ДоговорыКонтрагентов.Ссылка
		|		И РеализацияТоваровУслуг.Дата МЕЖДУ &ДатаНачало И &ДатаКонец
		|		И РеализацияТоваровУслуг.Проведен = ИСТИНА
		|		И РеализацияТоваровУслуг.ПометкаУдаления = ЛОЖЬ
		|ГДЕ
		|	ДоговорыКонтрагентов.ВидДоговора = &ВидДоговора
		|	И ДоговорыКонтрагентов.ВКМ_ДатаНачала <= &ДатаКонец
		|	И ДоговорыКонтрагентов.ВКМ_ДатаОкончания >= &ДатаНачало
		|	И ДоговорыКонтрагентов.ПометкаУдаления = ЛОЖЬ";
	
	Запрос.УстановитьПараметр("ВидДоговора", Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание);
	Запрос.УстановитьПараметр("ДатаНачало", НачалоПериода);
	Запрос.УстановитьПараметр("ДатаКонец", КонецПериода);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	СписокСозданныхРеализацийУслуг.Очистить();
	
	Пока Выборка.Следующий() Цикл
		
		НоваяСтрока = СписокСозданныхРеализацийУслуг.Добавить();
		НоваяСтрока.Договор = Выборка.Договор;

			Если Выборка.Реализация <> Неопределено Тогда
				НоваяСтрока.СсылкаНаРеализацию = Выборка.Реализация;
			КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры


#КонецОбласти

#КонецЕсли