#Если Сервер Тогда

#Область ОбработчикиСобытий
Процедура ОбработкаПроведения(Отказ,Режим)

	НДФЛ = Константы.ВКМ_НДФЛ.Получить();
	Если НДФЛ = 0 Тогда
		ОбщегоНазначения.СообщитьПользователю("Введите НДФЛ");
	КонецЕсли;
	
	// регистр ВКМ_Удержания
	Движения.ВКМ_Удержания.Записывать = Истина;
	Для Каждого ТекСтрокаСписокСотрудников из СписокСотрудников Цикл
		Движение = Движения.ВКМ_Удержания.Добавить();
		Движение.Сторно = Ложь;
		Движение.ВидРасчета = ПланыВидовРасчета.ВКМ_Удержания.НДФЛ;
		Движение.ПериодРегистрации = Дата;
		Движение.БазовыйПериодНачало = НачалоМесяца(Дата);
		Движение.БазовыйПериодКонец = КонецМесяца(Дата);
		Движение.Специалист = ТекСтрокаСписокСотрудников.Сотрудник;
	КонецЦикла;

	// регистр ВКМ_ДополнительныеНачисления
	Движения.ВКМ_ДополнительныеНачисления.Записывать = Истина;
	Для Каждого ТекСтрокаСписокСотрудников из СписокСотрудников Цикл
		Движение = Движения.ВКМ_ДополнительныеНачисления.Добавить();
		Движение.Сторно = Ложь;
		Движение.ВидРасчета = ПланыВидовРасчета.ВКМ_ДополнительныеНачисления.Премия;
		Движение.ПериодРегистрации = Дата;
		Движение.БазовыйПериодНачало = НачалоМесяца(Дата);
		Движение.БазовыйПериодКонец = КонецМесяца(Дата);
		Движение.Специалист = ТекСтрокаСписокСотрудников.Сотрудник;
		Движение.Результат = ТекСтрокаСписокСотрудников.СуммаПремии;
	КонецЦикла;

	//расчет суммы Удержания

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ВКМ_Удержания.НомерСтроки КАК НомерСтроки,
		|	ЕСТЬNULL(ВКМ_УдержанияБазаВКМ_ДополнительныеНачисления.РезультатБаза, 0) КАК РезультатБаза
		|ИЗ
		|	РегистрРасчета.ВКМ_Удержания КАК ВКМ_Удержания
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрРасчета.ВКМ_Удержания.БазаВКМ_ДополнительныеНачисления(&Измерение, &Измерение,,
		|			Регистратор = &Ссылка) КАК ВКМ_УдержанияБазаВКМ_ДополнительныеНачисления
		|		ПО ВКМ_Удержания.НомерСтроки = ВКМ_УдержанияБазаВКМ_ДополнительныеНачисления.НомерСтроки
		|ГДЕ
		|	ВКМ_Удержания.Регистратор = &Ссылка
		|	И ВКМ_Удержания.ВидРасчета = &НДФЛ";
	
	Запрос.УстановитьПараметр("НДФЛ", ПланыВидовРасчета.ВКМ_Удержания.НДФЛ);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
 	Измерение = Новый Массив;
	Измерение.Добавить("Специалист");
	Запрос.УстановитьПараметр("Измерение", Измерение);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		ДвижениеУдержания = Движения.ВКМ_Удержания[Выборка.НомерСтроки - 1];
		
		ДвижениеУдержания.Результат = Выборка.РезультатБаза * НДФЛ / 100;
		
	КонецЦикла;
	
	//ВзаиморасчетыССотрудниками

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ВКМ_ДополнительныеНачисления.Специалист КАК Специалист,
		|	СУММА(ВКМ_ДополнительныеНачисления.Результат) КАК СуммаДополнительныхНачислений,
		|	0 КАК СуммаУдержания
		|ПОМЕСТИТЬ ВременнаяТаблица
		|ИЗ
		|	РегистрРасчета.ВКМ_ДополнительныеНачисления КАК ВКМ_ДополнительныеНачисления
		|ГДЕ
		|	ВКМ_ДополнительныеНачисления.Регистратор = &Ссылка
		|СГРУППИРОВАТЬ ПО
		|	ВКМ_ДополнительныеНачисления.Специалист
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	ВКМ_Удержания.Специалист,
		|	0,
		|	СУММА(ВКМ_Удержания.Результат)
		|ИЗ
		|	РегистрРасчета.ВКМ_Удержания КАК ВКМ_Удержания
		|ГДЕ
		|	ВКМ_Удержания.Регистратор = &Ссылка
		|СГРУППИРОВАТЬ ПО
		|	ВКМ_Удержания.Специалист
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВременнаяТаблица.Специалист КАК Специалист,
		|	СУММА(ВременнаяТаблица.СуммаДополнительныхНачислений) КАК СуммаДополнительныхНачислений,
		|	СУММА(ВременнаяТаблица.СуммаУдержания) КАК СуммаУдержания
		|ИЗ
		|	ВременнаяТаблица КАК ВременнаяТаблица
		|СГРУППИРОВАТЬ ПО
		|	ВременнаяТаблица.Специалист";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Движения.ВКМ_ВзаиморасчетыССотрудниками.Записывать = Истина;
	
	Пока Выборка.Следующий() Цикл
		
		Сумма = Выборка.СуммаДополнительныхНачислений - Выборка.СуммаУдержания;
		
		Если Сумма = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		// регистр ВКМ_ВзаиморасчетыССотрудниками
		Движение = Движения.ВКМ_ВзаиморасчетыССотрудниками.Добавить();
		Движение.Период = Дата;
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Сотрудник = Выборка.Специалист;
		Движение.Сумма = Сумма;	
	КонецЦикла;
	
    Движения.ВКМ_ДополнительныеНачисления.Записать();
    Движения.ВКМ_Удержания.Записать();
    Движения.ВКМ_ВзаиморасчетыССотрудниками.Записать();


КонецПроцедуры

#КонецОбласти

#КонецЕсли