#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Адрес = Параметры.АдресВХранилище;
	Если  ЗначениеЗаполнено(Адрес) Тогда
		
	ОтпускаСотрудников = ПолучитьИзВременногоХранилища(Адрес);
	
	Если ОтпускаСотрудников <> Неопределено Тогда
			
	Для Каждого Строка Из ОтпускаСотрудников Цикл
	Точка = Диаграмма.УстановитьТочку(Строка.Сотрудник);
	Точка.Текст = Строка.Сотрудник.Наименование;
	Серия = Диаграмма.УстановитьСерию("Отпуск");
	Серия.Текст = "Отпуск";
	Значение = Диаграмма.ПолучитьЗначение(Точка, Серия);

	
	Интервал = Значение.Добавить();
	Интервал.Начало = Строка.ДатаНачала;
	Интервал.Конец = Строка.ДатаОкончания;
	
	СтрокаТаблицы = Объект.ОтпускаСотрудников.Добавить();
	ЗаполнитьЗначенияСвойств(СтрокаТаблицы, Строка);
	
	КонецЦикла;
	КонецЕсли;
	Иначе
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти