#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ,Режим)
	
	НДФЛ = Константы.ВКМ_НДФЛ.Получить();
	Если НДФЛ = 0 Тогда
		ОбщегоНазначения.СообщитьПользователю("Введите НДФЛ. Документ не проведен");
		Отказ = Истина;
	КонецЕсли;
	
	
	ОтпускЕсть = Ложь;
	
	СформироватьДвиженияОсновныеНачисленияУдержания(ОтпускЕсть);
	
	РассчитатьОклад();
	
	Если ОтпускЕсть Тогда
		РассчитатьОтпускные();
	КонецЕсли;
	
	РассчитатьНДФЛ(НДФЛ);
	
	СформироватьДвижениеВзаиморасчетыССотрудниками();

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура СформироватьДвиженияОсновныеНачисленияУдержания(ОтпускЕсть)

Запрос = Новый Запрос;
Запрос.Текст =
	"ВЫБРАТЬ
	|	ВКМ_НачисленияЗарплатыНачисления.Сотрудник КАК Сотрудник,
	|	ВКМ_НачисленияЗарплатыНачисления.ВидРасчета КАК ВидРасчета,
	|	ВКМ_НачисленияЗарплатыНачисления.ДатаНачала КАК ДатаНачала,
	|	ВКМ_НачисленияЗарплатыНачисления.ДатаОкончания КАК ДатаОкончания,
	|	ВКМ_НачисленияЗарплатыНачисления.ГрафикРаботы КАК ГрафикРаботы,
	|	ЕСТЬNULL(ВКМ_УсловияОплатыСотрудниковСрезПоследних.Оклад, 0) КАК Оклад,
	|	ВКМ_ВыполненныеСотрудникомРаботыОбороты.СуммаКОплатеПриход КАК СуммаКОплатеПриход
	|ИЗ
	|	Документ.ВКМ_НачисленияЗарплаты.Начисления КАК ВКМ_НачисленияЗарплатыНачисления
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ВКМ_УсловияОплатыСотрудников.СрезПоследних(&Период, Специалист В
	|			(ВЫБРАТЬ
	|				ВКМ_НачисленияЗарплатыНачисления.Сотрудник КАК Сотрудник
	|			ИЗ
	|				Документ.ВКМ_НачисленияЗарплаты.Начисления КАК ВКМ_НачисленияЗарплатыНачисления
	|			ГДЕ
	|				ВКМ_НачисленияЗарплатыНачисления.Ссылка = &Ссылка)) КАК ВКМ_УсловияОплатыСотрудниковСрезПоследних
	|		ПО ВКМ_НачисленияЗарплатыНачисления.Сотрудник = ВКМ_УсловияОплатыСотрудниковСрезПоследних.Специалист
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ВКМ_ВыполненныеСотрудникомРаботы.Обороты(&НачалоПериода, &КонецПериода,,
	|			Специалист В
	|			(ВЫБРАТЬ
	|				ВКМ_НачисленияЗарплатыНачисления.Сотрудник КАК Сотрудник
	|			ИЗ
	|				Документ.ВКМ_НачисленияЗарплаты.Начисления КАК ВКМ_НачисленияЗарплатыНачисления
	|			ГДЕ
	|				ВКМ_НачисленияЗарплатыНачисления.Ссылка = &Ссылка)) КАК ВКМ_ВыполненныеСотрудникомРаботыОбороты
	|		ПО ВКМ_НачисленияЗарплатыНачисления.Сотрудник = ВКМ_ВыполненныеСотрудникомРаботыОбороты.Специалист
	|ГДЕ
	|	ВКМ_НачисленияЗарплатыНачисления.Ссылка = &Ссылка";

Запрос.УстановитьПараметр("НачалоПериода", НачалоМесяца(Дата));
Запрос.УстановитьПараметр("Ссылка", Ссылка);
Запрос.УстановитьПараметр("КонецПериода", КонецМесяца(Дата));
Запрос.УстановитьПараметр("Период", Дата);

РезультатЗапроса = Запрос.Выполнить();

Выборка = РезультатЗапроса.Выбрать();

Движения.ВКМ_ОсновныеНачисления.Записывать = Истина;


Пока Выборка.Следующий() Цикл
	
		// регистр ВКМ_ОсновныеНачисления
		ДвижениеОсновныеНачисления = Движения.ВКМ_ОсновныеНачисления.Добавить();
		ДвижениеОсновныеНачисления.Сторно = Ложь;
		ДвижениеОсновныеНачисления.ВидРасчета = Выборка.ВидРасчета;
		ДвижениеОсновныеНачисления.ПериодРегистрации = Дата;
		ДвижениеОсновныеНачисления.ПериодДействияНачало = Выборка.ДатаНачала;
		ДвижениеОсновныеНачисления.ПериодДействияКонец = Выборка.ДатаОкончания;
		Если Выборка.ВидРасчета = ПланыВидовРасчета.ВКМ_ОсновныеНачисления.Отпуск Тогда
		ДвижениеОсновныеНачисления.БазовыйПериодНачало = НачалоМесяца(ДобавитьМесяц(Выборка.ДатаНачала, -12));
		ДвижениеОсновныеНачисления.БазовыйПериодКонец = КонецМесяца(ДобавитьМесяц(Выборка.ДатаОкончания, -1));
		ОтпускЕсть = Истина;
		КонецЕсли;
		ДвижениеОсновныеНачисления.Специалист = Выборка.Сотрудник;
		ДвижениеОсновныеНачисления.ГрафикРаботы = Выборка.ГрафикРаботы;
		Если Выборка.ВидРасчета = ПланыВидовРасчета.ВКМ_ОсновныеНачисления.Оклад Тогда
			ДвижениеОсновныеНачисления.Показатель = Выборка.Оклад;
		ИначеЕсли Выборка.ВидРасчета = ПланыВидовРасчета.ВКМ_ОсновныеНачисления.ПроцентОтРабот Тогда
			ДвижениеОсновныеНачисления.Результат = Выборка.СуммаКОплатеПриход;
		КонецЕсли;
		
		// регистр ВКМ_Удержания
		ДвижениеУдержания = Движения.ВКМ_Удержания.Добавить();
		ДвижениеУдержания.Сторно = Ложь;
		ДвижениеУдержания.ВидРасчета = ПланыВидовРасчета.ВКМ_Удержания.НДФЛ;
		ДвижениеУдержания.ПериодРегистрации = Дата;
		ДвижениеУдержания.БазовыйПериодНачало = НачалоМесяца(Дата);
		ДвижениеУдержания.БазовыйПериодКонец = КонецМесяца(Дата);
		ДвижениеУдержания.Специалист = Выборка.Сотрудник;	
		
КонецЦикла;

	Движения.ВКМ_ОсновныеНачисления.Записать();
	Движения.ВКМ_Удержания.Записать();
		
КонецПроцедуры

Процедура РассчитатьОклад()
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ВКМ_ОсновныеНачисленияДанныеГрафика.НомерСтроки КАК НомерСтроки,
		|	ВКМ_ОсновныеНачисленияДанныеГрафика.ЗначениеФактическийПериодДействия КАК Факт,
		|	ВКМ_ОсновныеНачисленияДанныеГрафика.ЗначениеПериодДействия КАК Норма
		|ИЗ
		|	РегистрРасчета.ВКМ_ОсновныеНачисления.ДанныеГрафика(ВидРасчета = &Оклад
		|	И Регистратор = &Ссылка) КАК ВКМ_ОсновныеНачисленияДанныеГрафика";
	
	Запрос.УстановитьПараметр("Оклад", ПланыВидовРасчета.ВКМ_ОсновныеНачисления.Оклад);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		// регистр ВКМ_ОсновныеНачисления
		ДвижениеОсновныеНачисления = Движения.ВКМ_ОсновныеНачисления[Выборка.НомерСтроки - 1];
		Если Выборка.Норма = 0 Тогда
			ДвижениеОсновныеНачисления.Результат = 0;
		КонецЕсли;
		
		ДвижениеОсновныеНачисления.Результат = ДвижениеОсновныеНачисления.Показатель * Выборка.Факт / Выборка.Норма;
		ДвижениеОсновныеНачисления.ОтработаноДней = Выборка.Факт;
		
	КонецЦикла;

	Движения.ВКМ_ОсновныеНачисления.Записать();
	
КонецПроцедуры

Процедура РассчитатьОтпускные()
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ВКМ_ОсновныеНачисления.НомерСтроки КАК НомерСтроки,
		|	ЕСТЬNULL(ВКМ_ОсновныеНачисленияБазаВКМ_ОсновныеНачисления.РезультатБаза, 0) КАК РезультатБаза,
		|	ЕСТЬNULL(ВКМ_ОсновныеНачисленияДанныеГрафика.ЗначениеФактическийПериодДействия, 0) КАК Факт,
		|	ЕСТЬNULL(ВКМ_ОсновныеНачисленияБазаВКМ_ОсновныеНачисления.ОтработаноДнейБаза, 0) КАК ОтработаноДнейБаза
		|ИЗ
		|	РегистрРасчета.ВКМ_ОсновныеНачисления КАК ВКМ_ОсновныеНачисления
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрРасчета.ВКМ_ОсновныеНачисления.БазаВКМ_ОсновныеНачисления(&Измерение, &Измерение,,
		|			Регистратор = &Ссылка
		|		И ВидРасчета = &Отпуск) КАК ВКМ_ОсновныеНачисленияБазаВКМ_ОсновныеНачисления
		|		ПО ВКМ_ОсновныеНачисления.НомерСтроки = ВКМ_ОсновныеНачисленияБазаВКМ_ОсновныеНачисления.НомерСтроки
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрРасчета.ВКМ_ОсновныеНачисления.ДанныеГрафика(Регистратор = &Ссылка
		|		И ВидРасчета = &Отпуск) КАК ВКМ_ОсновныеНачисленияДанныеГрафика
		|		ПО ВКМ_ОсновныеНачисления.НомерСтроки = ВКМ_ОсновныеНачисленияДанныеГрафика.НомерСтроки
		|ГДЕ
		|	ВКМ_ОсновныеНачисления.Регистратор = &Ссылка
		|	И ВКМ_ОсновныеНачисления.ВидРасчета = &Отпуск";
	
	
	Запрос.УстановитьПараметр("Отпуск", ПланыВидовРасчета.ВКМ_ОсновныеНачисления.Отпуск);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Измерение = Новый Массив;
	Измерение.Добавить("Специалист");
	Запрос.УстановитьПараметр("Измерение", Измерение);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		ДвижениеОсновныеНачисления = Движения.ВКМ_ОсновныеНачисления[Выборка.НомерСтроки - 1];
		ДвижениеОсновныеНачисления.Показатель = Выборка.РезультатБаза;
		ДвижениеОсновныеНачисления.ОтработаноДней = Выборка.Факт;
		
		Если Выборка.ОтработаноДнейБаза = 0 Тогда
			ДвижениеОсновныеНачисления.Результат = 0;
			Продолжить;
		КонецЕсли;
		
		ДвижениеОсновныеНачисления.Результат = Выборка.РезультатБаза * Выборка.Факт / Выборка.ОтработаноДнейБаза;

	КонецЦикла;

	Движения.ВКМ_ОсновныеНачисления.Записать();
		
	
КонецПроцедуры

Процедура РассчитатьНДФЛ(НДФЛ)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ВКМ_Удержания.НомерСтроки КАК НомерСтроки,
		|	ЕСТЬNULL(ВКМ_УдержанияБазаВКМ_ОсновныеНачисления.РезультатБаза, 0) КАК РезультатБаза
		|ИЗ
		|	РегистрРасчета.ВКМ_Удержания КАК ВКМ_Удержания
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрРасчета.ВКМ_Удержания.БазаВКМ_ОсновныеНачисления(&Измерение, &Измерение,,
		|			Регистратор = &ССылка) КАК ВКМ_УдержанияБазаВКМ_ОсновныеНачисления
		|		ПО ВКМ_Удержания.НомерСтроки = ВКМ_УдержанияБазаВКМ_ОсновныеНачисления.НомерСтроки
		|ГДЕ
		|	ВКМ_Удержания.ВидРасчета = &НДФЛ
		|	И ВКМ_Удержания.Регистратор = &Ссылка";
	
	Запрос.УстановитьПараметр("НДФЛ", ПланыВидовРасчета.ВКМ_Удержания.НДФЛ);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
 	Измерение = Новый Массив;
	Измерение.Добавить("Специалист");
	Запрос.УстановитьПараметр("Измерение", Измерение);
	
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		ДвижениеУдержания = Движения.ВКМ_Удержания[Выборка.НомерСтроки - 1];
		
		ДвижениеУдержания.Результат = Выборка.РезультатБаза * НДФЛ / 100;
		
	КонецЦикла;
	
	Движения.ВКМ_Удержания.Записать();
	
КонецПроцедуры	


Процедура СформироватьДвижениеВзаиморасчетыССотрудниками()
	
	Движения.ВКМ_ВзаиморасчетыССотрудниками.Записывать = Истина;
	Движения.ВКМ_ВзаиморасчетыССотрудниками.Очистить();

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ВКМ_ОсновныеНачисления.Специалист КАК Специалист,
		|	СУММА(ВКМ_ОсновныеНачисления.Результат) КАК СуммаОсновныеНачисления,
		|	0 КАК СуммаУдержания
		|ПОМЕСТИТЬ ВременнаяТаблица
		|ИЗ
		|	РегистрРасчета.ВКМ_ОсновныеНачисления КАК ВКМ_ОсновныеНачисления
		|ГДЕ
		|	ВКМ_ОсновныеНачисления.Регистратор = &Ссылка
		|СГРУППИРОВАТЬ ПО
		|	ВКМ_ОсновныеНачисления.Специалист
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВКМ_Удержания.Специалист,
		|	0,
		|	СУММА(ВКМ_Удержания.Результат)
		|ИЗ
		|	РегистрРасчета.ВКМ_Удержания КАК ВКМ_Удержания
		|ГДЕ
		|	ВКМ_Удержания.Регистратор = &Ссылка
		|СГРУППИРОВАТЬ ПО
		|	ВКМ_Удержания.Специалист
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВременнаяТаблица.Специалист КАК Специалист,
		|	СУММА(ВременнаяТаблица.СуммаОсновныеНачисления) КАК СуммаОсновныеНачисления,
		|	СУММА(ВременнаяТаблица.СуммаУдержания) КАК СуммаУдержания
		|ИЗ
		|	ВременнаяТаблица КАК ВременнаяТаблица
		|СГРУППИРОВАТЬ ПО
		|	ВременнаяТаблица.Специалист";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Сумма = Выборка.СуммаОсновныеНачисления - Выборка.СуммаУдержания;
		Если Сумма = 0 Тогда
			Продолжить;
		КонецЕсли;
				
			// регистр ВКМ_ВзаиморасчетыССотрудниками
		Движение = Движения.ВКМ_ВзаиморасчетыССотрудниками.Добавить();
		Движение.Период = Дата;
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Сотрудник = Выборка.Специалист;
		Движение.Сумма = Сумма;
		
	КонецЦикла;

	Движения.ВКМ_ВзаиморасчетыССотрудниками.Записать();
КонецПроцедуры


#КонецОбласти

#КонецЕсли