#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	ВКМ_СоздатьЭлементыФормы();
		
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ВКМ_УстановитьВидимостьЭлементов();	
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ВидДоговораПриИзменении(Элемент)
	
	ВКМ_УстановитьВидимостьЭлементов();	
	
КонецПроцедуры
	
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ВКМ_СоздатьЭлементыФормы()
	
		Если Элементы.Найти("ВКМ_ДатаНачала") = Неопределено Тогда
		ЭлементДатаНачала = Элементы.Добавить("ВКМ_ДатаНачала", Тип("ПолеФормы"));
		ЭлементДатаНачала.Вид = ВидПоляФормы.ПолеВвода;
		ЭлементДатаНачала.ПутьКДанным = "Объект.ВКМ_ДатаНачала";
		ЭлементДатаНачала.Заголовок = "Дата начала действия";
		КонецЕсли;
		
		Если Элементы.Найти("ВКМ_ДатаОкончания") = Неопределено Тогда
		ЭлементДатаОкончания = Элементы.Добавить("ВКМ_ДатаОкончания", Тип("ПолеФормы"));
		ЭлементДатаОкончания.Вид = ВидПоляФормы.ПолеВвода;
		ЭлементДатаОкончания.ПутьКДанным = "Объект.ВКМ_ДатаОкончания";
		ЭлементДатаОкончания.Заголовок = "Дата окончания действия";
		КонецЕсли;
		
		Если Элементы.Найти("ВКМ_СуммаАбонентскойПлаты") = Неопределено Тогда	
		ЭлементСуммаАбоненсткойПлаты = Элементы.Добавить("ВКМ_СуммаАбонентскойПлаты", Тип("ПолеФормы"));
		ЭлементСуммаАбоненсткойПлаты.Вид = ВидПоляФормы.ПолеВвода;
		ЭлементСуммаАбоненсткойПлаты.ПутьКДанным = "Объект.ВКМ_СуммаАбонентскойПлаты";
		ЭлементСуммаАбоненсткойПлаты.Заголовок = "Сумма абонентской платы";
	   	КонецЕсли;
		
		Если Элементы.Найти("ВКМ_СтоимостьЧаса") = Неопределено Тогда		
		ЭлементСтоимостьЧаса = Элементы.Добавить("ВКМ_СтоимостьЧаса", Тип("ПолеФормы"));
		ЭлементСтоимостьЧаса.Вид = ВидПоляФормы.ПолеВвода;
		ЭлементСтоимостьЧаса.ПутьКДанным = "Объект.ВКМ_СтоимостьЧаса";
		ЭлементСтоимостьЧаса.Заголовок = "Стоимость часа";
		КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВКМ_УстановитьВидимостьЭлементов()
	
	ЭтоАбонентскоеОбслуживание = Объект.ВидДоговора = ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание");
		
	Элементы.ВКМ_ДатаНачала.Видимость = ЭтоАбонентскоеОбслуживание;
	Элементы.ВКМ_ДатаОкончания.Видимость = ЭтоАбонентскоеОбслуживание;
	Элементы.ВКМ_СуммаАбонентскойПлаты.Видимость = ЭтоАбонентскоеОбслуживание;
	Элементы.ВКМ_СтоимостьЧаса.Видимость = ЭтоАбонентскоеОбслуживание;
	
КонецПроцедуры



#КонецОбласти
