

#Область ПрограммныйИнтерфейс
//ВКМ_Начало
Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка) Экспорт
	СтандартнаяОбработка = Ложь;
	Поля.Добавить("Наименование");
	Поля.Добавить("Владелец");
	Поля.Добавить("ВидДоговора");
	Поля.Добавить("Код");
КонецПроцедуры


Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка) Экспорт
	СтандартнаяОбработка = Ложь;
	Представление = СтрШаблон("%1 договор с контрагентом ""%2"" %3", Данные.Наименование, Данные.Владелец, Данные.Код);
КонецПроцедуры
//ВКМ_Конец
#КонецОбласти	