
#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Заполнить(Команда)
	
	ЗаполнитьНаСервере();
	
КонецПроцедуры


&НаКлиенте
Процедура СоздатьРеализацию(Команда)
	
	ДлительнаяОперация = СоздатьРеализациюНаСервере();
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.Интервал = 1;
	Оповещение = Новый ОписаниеОповещения("ОповещениеЗавершения", ЭтотОбъект);
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, Оповещение, ПараметрыОжидания);
КонецПроцедуры


&НаКлиенте
Процедура ПечатьАктов(Команда)
	
	Если Объект.СписокСозданныхРеализацийУслуг.Количество() = 0 Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Нет созданных реализаций для печати!");
		Возврат;
	КонецЕсли;
	
	ПечатьАктовНаКлиенте();
	
КонецПроцедуры



#КонецОбласти


#Область СлужебныеПроцедурыИФункции
&НаКлиенте
Процедура ОповещениеЗавершения(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат.Статус = "Выполнено" Тогда
		ОбработатьРезультатНаСервере(Результат.АдресРезультата);

	Иначе
		ОбщегоНазначенияКлиент.СообщитьПользователю("Ошибка при выполнении операции: " + Результат.КраткоеПредставлениеОшибки);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьРезультатНаСервере(АдресРезультата)
	
	ТаблицаРезультата = ПолучитьИзВременногоХранилища(АдресРезультата);
		ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
		ОбработкаОбъект.СписокСозданныхРеализацийУслуг.Очистить();
		Для Каждого СтрокаРезультат Из ТаблицаРезультата Цикл
			НоваяСтрока = ОбработкаОбъект.СписокСозданныхРеализацийУслуг.Добавить();
			НоваяСтрока.Договор = СтрокаРезультат.Договор;
			НоваяСтрока.СсылкаНаРеализацию = СтрокаРезультат.СсылкаНаРеализацию;
		КонецЦикла;
	ЗначениеВРеквизитФормы(ОбработкаОбъект, "Объект");
	ОбщегоНазначения.СообщитьПользователю(СтрШаблон("Создано %1 реализаций услуг", ТаблицаРезультата.Количество()));
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНаСервере()
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	ОбработкаОбъект.ЗаполнитьСписокДоговоров(Объект.Период);
	
	ЗначениеВРеквизитФормы(ОбработкаОбъект, "Объект");
КонецПроцедуры

&НаКлиенте
Процедура ПечатьАктовНаКлиенте()
	
	МассивДокументов = МассивСсылокДляПечати();
	Если МассивДокументов.Количество() = 0  Тогда
		Возврат;
	КонецЕсли;
	
	УправлениеПечатьюКлиент.ВыполнитьКомандуПечати("Документ.РеализацияТоваровУслуг", 
							"АктОбОказанныхУслугах" ,
							МассивДокументов,
							ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Функция СоздатьРеализациюНаСервере()
	
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	ТаблицаДоговоров = ОбработкаОбъект.СписокСозданныхРеализацийУслуг.Выгрузить();
	ДлительнаяОперация = ДлительныеОперации.ВыполнитьФункцию(УникальныйИдентификатор, "Обработки.ВКМ_МассовоеСозданиеАктов.СоздатьИлиОбновитьРеализации", ОбработкаОбъект.Период, ТаблицаДоговоров);
	Возврат ДлительнаяОперация;
	
КонецФункции

&НаСервере
Функция МассивСсылокДляПечати()
	
	МассивДокументов = Новый Массив;
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	ТаблицаДоговоров = ОбработкаОбъект.СписокСозданныхРеализацийУслуг.Выгрузить();
	Для Каждого Строка Из ТаблицаДоговоров Цикл
		Если ЗначениеЗаполнено(Строка.СсылкаНаРеализацию) Тогда
			МассивДокументов.Добавить(Строка.СсылкаНаРеализацию);
		КонецЕсли;
	КонецЦикла;
	
	Возврат МассивДокументов;

КонецФункции

#КонецОбласти
